[
{"Title": "An Exploratory Study of the Overrepresentation of Incarcerated African American Males", "Author": "Davis-Wagner, Dianne LaVerne", "Advisor": "Glasgow, Douglas", "Year": 2000, "Abstract": "A within group study of the overrepresentation of incarcerated African American males in local jails was conducted using variables consisting of structural influences as measured by family structure, educational experiences, and employment experiences as possible contributors to this occurrence. Merton's Theory of Social Structure and Anomie and Cloward and Ohlins' Opportunity Theory provided the theoretical basis for this study. Secondary data obtained from the 1996 Bureau of Justice Statistics Survey of Local Jail Inmates was used. A sub-sample of 864 African American male inmates 18–29 representing 47.03% of the total population of African American males in the jail survey sample was used for this research. Responses to selected items on the socioeconomic section of the survey instrument were analyzed using descriptive and chi square statistical measures. The results did not support the three null hypotheses. Significant differences were found between family structure and highest grade attended, employment and highest grade attended; employment and yearly income. The implications from these findings suggest that African American males in the age group 18–29, despite their probability for employment and increased educational status, are at higher risk for underemployment/unemployment and low income. Consequently, it is suggested that these structural influences may provide an important link to the causes of disproportionate imprisonment among African American males. The findings provide preliminary evidence of these issues.Additional research is needed to obtain increased statistical support in the relationship between structural influences and the overrepresentation of incarcerated African American males. ", "University": "Norfolk State University", "Degree": "D.S.W.", "Subject": ["Social work", "Criminology", "Social structure", "African Americans"], "Keywords": ["Social sciences", " African American", " Incarcerated", " Men", " Overrepresentation"], "HTMLDictionary": {"An_Exploratory_Study_of": "An Exploratory Study of the Overrepresentation of Incarcerated African American Males - ProQuest Dis.html"}, "PDFDictionary": {"An_Exploratory_Study_of": "An_Exploratory_Study_of_the_Ov.pdf"}, "NumberOfPages": 172, "Department": "", "Language": "English", "CommitteeMembers": "", "ProQuestID": 4678289, "DocumentURL": "http://proxy.lib.odu.edu/login?url=https://www-proquest-com.proxy.lib.odu.edu/dissertations-theses/exploratory-study-overrepresentation-incarcerated/docview/304678289/se-2?accountid=12967", "CopyRight": "Database copyright ProQuest LLC; ProQuest does not claim copyright in the individual underlying works."},
{"Title": "Public Managers' Training and Development: An Extension of Mintzberg's Theory of Managerial Work", "Author": "Valencia, Sergio F.", "Advisor": "", "Year": 1989, "Abstract": "This study proposes a generic public managers' training and development approach. By using Henry Mintzberg's theory of managerial work, a tool for evaluating and designing instruction programs is developed.A National Science Foundation (NSF) sponsored public manager's survey, involving analysis of survey data from more than 1,400 Kentucky state employees, is used to test the three working hypotheses of the study. Through these hypotheses the study suggests that based in Mintzberg's theory, a comprehensive managerial instructional scheme can be developed; that this model can accommodate individual variables; and that it can be used to evaluate and design managerial training and development programs.This proposition is elaborated through the first four chapters of the study. In the last chapter, a practical use for the new instructional strategy is presented. In this application, the Governmental Services Center (GSC) program entitled Kentucky Career Managers program is evaluated and the main conclusions are presented.Finally, the thesis shows that Mintzberg's theory can be extended to the managerial training and development field, and that this extension provides a simple and useful tool for the design and evaluation of managerial training and development programs.", "University": "Kentucky State University", "Degree": "M.P.A.", "Subject": ["Public administration"], "Keywords": ["Social sciences", " Mintzberg, Henry", " Managerial work", " Kentucky"], "HTMLDictionary": {"An_Exploratory_Study_of": "An Exploratory Study of the Overrepresentation of Incarcerated African American Males - ProQuest Dis.html", "Public_Managers'_Training_and": "Public Managers' Training and Development_ An Extension of Mintzberg's Theory of Managerial Work - P.html"}, "PDFDictionary": {"An_Exploratory_Study_of": "An_Exploratory_Study_of_the_Ov.pdf", "Public_Managers'_Training_and": "Public_Managers'_Training_and_.pdf"}, "NumberOfPages": 135, "Department": "", "Language": "English", "CommitteeMembers": "", "ProQuestID": 3779417, "DocumentURL": "http://proxy.lib.odu.edu/login?url=https://www-proquest-com.proxy.lib.odu.edu/dissertations-theses/public-managers-training-development-extension/docview/303779417/se-2?accountid=12967", "CopyRight": "Database copyright ProQuest LLC; ProQuest does not claim copyright in the individual underlying works."}
]