{"Title": "Public Managers' Training and Development: An Extension of Mintzberg's Theory of Managerial Work", "Author": "Valencia, Sergio F.", "Advisor": "", "Year": 1989, "Abstract": "This study proposes a generic public managers' training and development approach. By using Henry Mintzberg's theory of managerial work, a tool for evaluating and designing instruction programs is developed.A National Science Foundation (NSF) sponsored public manager's survey, involving analysis of survey data from more than 1,400 Kentucky state employees, is used to test the three working hypotheses of the study. Through these hypotheses the study suggests that based in Mintzberg's theory, a comprehensive managerial instructional scheme can be developed; that this model can accommodate individual variables; and that it can be used to evaluate and design managerial training and development programs.This proposition is elaborated through the first four chapters of the study. In the last chapter, a practical use for the new instructional strategy is presented. In this application, the Governmental Services Center (GSC) program entitled Kentucky Career Managers program is evaluated and the main conclusions are presented.Finally, the thesis shows that Mintzberg's theory can be extended to the managerial training and development field, and that this extension provides a simple and useful tool for the design and evaluation of managerial training and development programs.", "University": "Kentucky State University", "Degree": "M.P.A.", "Subject": ["Public administration"], "Keywords": ["Social sciences", " Mintzberg, Henry", " Managerial work", " Kentucky"], "HTMLDictionary": {"An_Exploratory_Study_of": "An Exploratory Study of the Overrepresentation of Incarcerated African American Males - ProQuest Dis.html", "Public_Managers'_Training_and": "Public Managers' Training and Development_ An Extension of Mintzberg's Theory of Managerial Work - P.html"}, "PDFDictionary": {"An_Exploratory_Study_of": "An_Exploratory_Study_of_the_Ov.pdf", "Public_Managers'_Training_and": "Public_Managers'_Training_and_.pdf"}, "NumberOfPages": 135, "Department": "", "Language": "English", "CommitteeMembers": "", "ProQuestID": 3779417, "DocumentURL": "http://proxy.lib.odu.edu/login?url=https://www-proquest-com.proxy.lib.odu.edu/dissertations-theses/public-managers-training-development-extension/docview/303779417/se-2?accountid=12967", "CopyRight": "Database copyright ProQuest LLC; ProQuest does not claim copyright in the individual underlying works."}
